a dataframe is a table it contain an array of indivusal entries which of which has a certain value each entry cospondes to a row and a colum

In [1]:
import pandas as pd

In [2]:
pd.DataFrame({"name":['mayank','deepak'],"age":[22,25]})

     name  age
0  mayank   22
1  deepak   25

In [3]:
df=pd.DataFrame({"name":['mayank','deepak'],"age":['',25]})
df.isnull()

    name    age
0  False  False
1  False  False

In [4]:
df["name"]=df["name"].replace('mayank','amit')

In [5]:
df

     name age
0    amit
1  deepak  25

In [6]:
df['age']=df['age'].replace('',26)
df

     name  age
0    amit   26
1  deepak   25

In [7]:
df2=pd.DataFrame({'name':['mayank','singh'],'age':[22,25]},index=['object','class'])
df2

          name  age
object  mayank   22
class    singh   25

SERIES= a seires by contrast is asequence of data values if a dataframe is a table a series is a list.
and infact you can create one with nothing more than a list.
pd.Series([])

In [8]:
pd.Series([1,5,8,7])

0    1
1    5
2    8
3    7
dtype: int64

In [9]:
import random
v=[]
for i in range(1,25):
    v.append(random.randrange(1,5))
pd.Series(v)

0     2
1     1
2     2
3     3
4     4
5     3
6     2
7     3
8     4
9     1
10    3
11    1
12    2
13    2
14    1
15    1
16    4
17    3
18    1
19    3
20    3
21    2
22    2
23    1
dtype: int64

In [10]:
import pandas as pd

In [15]:
df=pd.read_csv("../practice1/practice.csv")
df.head

<bound method NDFrame.head of                                              a,b,c,d
0  0.039761986133905136,0.2185172274750622,0.1034...
1  0.9372879037285884,0.04156728027953449,0.89912...
2  0.7805044779316328,0.008947537857148302,0.5578...
3  0.6727174963492204,0.24786984946279625,0.26407...
4  0.05382860859967886,0.5201244020579979,0.55226...
5  0.2860433671280178,0.5934650440000543,0.907307...
6  0.4304355863327313,0.16623013749421356,0.46938...
7  0.3122955538295512,0.5028232900921878,0.806608...
8  0.1877648514121828,0.9970746427719338,0.895955...
9  0.9081621790575398,0.23272641071536715,0.41413...>